package org.leetcode.leet2000.ch1800;

/**
 * <p>1763. 最长的美好子字符串
 *
 * <p>当一个字符串 s 包含的每一种字母的大写和小写形式 同时 出现在 s 中，就称这个字符串 s 是 美好 字符串。比方说，"abABB" 是美好字符串，因为 'A' 和 'a' 同时出现了，且 'B' 和 'b'
 * 也同时出现了。然而，"abA" 不是美好字符串因为 'b' 出现了，而 'B' 没有出现。
 *
 * <p>给你一个字符串 s ，请你返回 s 最长的 美好子字符串 。如果有多个答案，请你返回 最早 出现的一个。如果不存在美好子字符串，请你返回一个空字符串。
 *
 *
 *
 * <p>示例 1：
 *
 * <p>输入：s = "YazaAay"
 * <p>输出："aAa"
 * <p>解释："aAa" 是一个美好字符串，因为这个子串中仅含一种字母，其小写形式 'a' 和大写形式 'A' 也同时出现了。
 * <p>"aAa" 是最长的美好子字符串。
 *
 * <p>示例 2：
 *
 * <p>输入：s = "Bb"
 * <p>输出："Bb"
 * <p>解释："Bb" 是美好字符串，因为 'B' 和 'b' 都出现了。整个字符串也是原字符串的子字符串。
 *
 * <p>示例 3：
 *
 * <p>输入：s = "c"
 * <p>输出：""
 * <p>解释：没有美好子字符串。
 *
 * <p>示例 4：
 *
 * <p>输入：s = "dDzeE"
 * <p>输出："dD"
 * <p>解释："dD" 和 "eE" 都是最长美好子字符串。
 * <p>由于有多个美好子字符串，返回 "dD" ，因为它出现得最早。
 *
 *
 *
 * <p>提示：
 *
 * <p>    1 <= s.length <= 100
 * <p>    s 只包含大写和小写英文字母。
 *
 * <p>通过次数2,657
 * <p>提交次数4,355
 * <p>请问您在哪类招聘中遇到此题？
 * <p>https://leetcode-cn.com/problems/longest-nice-substring/
 * <p>@Author: shenpei
 * <p>@Date: 2021/4/25 10:06 下午
 */
public class NCh1763LongestNiceSubstring {

  public String longestNiceSubstring(String s) {
    return null;
  }
}
