package org.company.meituan.all.week02.doing;

/**
 *<p>2. 两数相加
 *
 *<p>给你两个 非空 的链表，表示两个非负的整数。它们每位数字都是按照 逆序 的方式存储的，并且每个节点只能存储 一位 数字。
 *
 *<p>请你将两个数相加，并以相同形式返回一个表示和的链表。
 *
 *<p>你可以假设除了数字 0 之外，这两个数都不会以 0 开头。
 *
 *
 *
 *<p>示例 1：
 *
 *<p>输入：l1 = [2,4,3], l2 = [5,6,4]
 *<p>输出：[7,0,8]
 *<p>解释：342 + 465 = 807.
 *
 *<p>示例 2：
 *
 *<p>输入：l1 = [0], l2 = [0]
 *<p>输出：[0]
 *
 *<p>示例 3：
 *
 *<p>输入：l1 = [9,9,9,9,9,9,9], l2 = [9,9,9,9]
 *<p>输出：[8,9,9,9,0,0,0,1]
 *
 *
 *
 *<p>提示：
 *
 *<p>    每个链表中的节点数在范围 [1, 100] 内
 *<p>    0 <= Node.val <= 9
 *<p>    题目数据保证列表表示的数字不含前导零
 *
 *<p>通过次数838,284
 *<p>提交次数2,087,317
 *<p>https://leetcode-cn.com/problems/add-two-numbers/
 *<p>@author: wangrui
 *<p>@date: 2021/5/14
 */
public class Ch053_2_AddTwoNumbers两数相加 {

}
