package org.company.meituan.all.week02.day02;

/**
 * <p>191. 位1的个数
 * <p>编写一个函数，输入是一个无符号整数（以二进制串的形式），返回其二进制表达式中数字位数为 '1' 的个数（也被称为汉明重量）。
 *
 *
 *
 * <p>提示：
 *
 * <p>请注意，在某些语言（如 Java）中，没有无符号整数类型。在这种情况下，输入和输出都将被指定为有符号整数类型，并且不应影响您的实现，因为无论整数是有符号的还是无符号的，其内部的二进制表示形式都是相同的。
 * <p>在 Java 中，编译器使用二进制补码记法来表示有符号整数。因此，在上面的 示例 3 中，输入表示有符号整数 -3。
 *
 *
 * <p>示例 1：
 *
 * <p>输入：00000000000000000000000000001011
 * <p>输出：3
 * <p>解释：输入的二进制串 00000000000000000000000000001011 中，共有三位为 '1'。
 * <p>示例 2：
 *
 * <p>输入：00000000000000000000000010000000
 * <p>输出：1
 * <p>解释：输入的二进制串 00000000000000000000000010000000 中，共有一位为 '1'。
 * <p>示例 3：
 *
 * <p>输入：11111111111111111111111111111101
 * <p>输出：31
 * <p>解释：输入的二进制串 11111111111111111111111111111101 中，共有 31 位为 '1'。
 *
 *
 * <p>提示：
 *
 * <p>输入必须是长度为 32 的 二进制串 。
 *
 *
 * <p>进阶：
 *
 * <p>如果多次调用这个函数，你将如何优化你的算法？
 * <p>通过次数162,135提交次数219,140
 * <p>贡献者
 * <p>LeetCode
 * <p>191/2088
 *
 * <p>智能模式
 *
 * <p>模拟面试
 *
 *
 *
 *
 *
 *
 * <p>123456
 * <p>public class Solution {
 * <p>    // you need to treat n as an unsigned value
 * <p>    public int hammingWeight(int n) {
 *
 * <p>    }
 * <p>}
 * <p>贡献
 * <p>https://leetcode-cn.com/problems/number-of-1-bits/
 * <p>@Author: shenpei
 * <p>@Date: 2021/5/17 6:55 下午
 */
public class Ch075_191_numberOf1Bits位1的个数 {
    public int hammingWeight(int n) {
        return -1;
    }
}
